#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cloudsbits/audiotube-org/runs/run-bUHUVpF7JhApmz8j

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_organizations_account.audiotube_infrastructure_preprod will be created
  + resource "aws_organizations_account" "audiotube_infrastructure_preprod" {
      + arn               = (known after apply)
      + close_on_deletion = true
      + create_govcloud   = false
      + email             = "audiotube-infrastructure-preprod@cloudsbits.com"
      + govcloud_id       = (known after apply)
      + id                = (known after apply)
      + joined_method     = (known after apply)
      + joined_timestamp  = (known after apply)
      + name              = "audiotube-infrastructure-preprod"
      + parent_id         = (known after apply)
      + role_name         = "Org-Admin"
      + status            = (known after apply)
      + tags_all          = (known after apply)
    }

  # aws_organizations_account.audiotube_infrastructure_prod will be created
  + resource "aws_organizations_account" "audiotube_infrastructure_prod" {
      + arn               = (known after apply)
      + close_on_deletion = true
      + create_govcloud   = false
      + email             = "audiotube-infrastructure-prod@cloudsbits.com"
      + govcloud_id       = (known after apply)
      + id                = (known after apply)
      + joined_method     = (known after apply)
      + joined_timestamp  = (known after apply)
      + name              = "audiotube-infrastructure-prod"
      + parent_id         = (known after apply)
      + role_name         = "Org-Admin"
      + status            = (known after apply)
      + tags_all          = (known after apply)
    }

  # aws_organizations_account.audiotube_sandbox will be created
  + resource "aws_organizations_account" "audiotube_sandbox" {
      + arn               = (known after apply)
      + close_on_deletion = true
      + create_govcloud   = false
      + email             = "audiotube-sandbox@cloudsbits.com"
      + govcloud_id       = (known after apply)
      + id                = (known after apply)
      + joined_method     = (known after apply)
      + joined_timestamp  = (known after apply)
      + name              = "audiotube-sandbox"
      + parent_id         = (known after apply)
      + role_name         = "Org-Admin"
      + status            = (known after apply)
      + tags_all          = (known after apply)
    }

  # aws_organizations_account.audiotube_security_prod will be created
  + resource "aws_organizations_account" "audiotube_security_prod" {
      + arn               = (known after apply)
      + close_on_deletion = true
      + create_govcloud   = false
      + email             = "audiotube-security-prod@cloudsbits.com"
      + govcloud_id       = (known after apply)
      + id                = (known after apply)
      + joined_method     = (known after apply)
      + joined_timestamp  = (known after apply)
      + name              = "audiotube-security-prod"
      + parent_id         = (known after apply)
      + role_name         = "Org-Admin"
      + status            = (known after apply)
      + tags_all          = (known after apply)
    }

  # aws_organizations_account.audiotube_workloads_preprod will be created
  + resource "aws_organizations_account" "audiotube_workloads_preprod" {
      + arn               = (known after apply)
      + close_on_deletion = true
      + create_govcloud   = false
      + email             = "audiotube-workloads-preprod@cloudsbits.com"
      + govcloud_id       = (known after apply)
      + id                = (known after apply)
      + joined_method     = (known after apply)
      + joined_timestamp  = (known after apply)
      + name              = "audiotube-workloads-preprod"
      + parent_id         = (known after apply)
      + role_name         = "Org-Admin"
      + status            = (known after apply)
      + tags_all          = (known after apply)
    }

  # aws_organizations_account.audiotube_workloads_prod will be created
  + resource "aws_organizations_account" "audiotube_workloads_prod" {
      + arn               = (known after apply)
      + close_on_deletion = true
      + create_govcloud   = false
      + email             = "audiotube-workloads-prod@cloudsbits.com"
      + govcloud_id       = (known after apply)
      + id                = (known after apply)
      + joined_method     = (known after apply)
      + joined_timestamp  = (known after apply)
      + name              = "audiotube-workloads-prod"
      + parent_id         = (known after apply)
      + role_name         = "Org-Admin"
      + status            = (known after apply)
      + tags_all          = (known after apply)
    }

  # aws_organizations_organization.audiotube will be created
  + resource "aws_organizations_organization" "audiotube" {
      + accounts                      = (known after apply)
      + arn                           = (known after apply)
      + aws_service_access_principals = [
          + "cloudtrail.amazonaws.com",
          + "sso.amazonaws.com",
        ]
      + feature_set                   = "ALL"
      + id                            = (known after apply)
      + master_account_arn            = (known after apply)
      + master_account_email          = (known after apply)
      + master_account_id             = (known after apply)
      + non_master_accounts           = (known after apply)
      + roots                         = (known after apply)
    }

  # aws_organizations_organizational_unit.infrastructure will be created
  + resource "aws_organizations_organizational_unit" "infrastructure" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Infrastructure"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_organizations_organizational_unit.infrastructure_preprod will be created
  + resource "aws_organizations_organizational_unit" "infrastructure_preprod" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Preprod"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_organizations_organizational_unit.infrastructure_prod will be created
  + resource "aws_organizations_organizational_unit" "infrastructure_prod" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Prod"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_organizations_organizational_unit.prod will be created
  + resource "aws_organizations_organizational_unit" "prod" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Prod"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_organizations_organizational_unit.sandbox will be created
  + resource "aws_organizations_organizational_unit" "sandbox" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Sandbox"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_organizations_organizational_unit.security will be created
  + resource "aws_organizations_organizational_unit" "security" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Security"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_organizations_organizational_unit.workloads will be created
  + resource "aws_organizations_organizational_unit" "workloads" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Workloads"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_organizations_organizational_unit.workloads_preprod will be created
  + resource "aws_organizations_organizational_unit" "workloads_preprod" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Preprod"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_organizations_organizational_unit.workloads_prod will be created
  + resource "aws_organizations_organizational_unit" "workloads_prod" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Prod"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 16 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @Kostua, Action: `pull_request`*